Goal-App/app/models/user.rb

  def self.find_by_credentials(username, password)
      user = User.find_by(username: 'me@email.com')
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "me@email.com"], ["LIMIT", 1]]